controllers/ClienteController.php

    public function actionCadastrar()
    {
        try {
            $request = Yii::$app->request;
            if (!AuthService::validarToken($request)) {
                // Requisição não é do tipo POST
                Yii::$app->response->statusCode = 405; // Method Not Allowed
                return json_encode(['success' => false, 'message' => 'Token Invalido.']);
            }
            // Verificar se é uma requisição POST
            if (!$request->isPost) {
                // Requisição não é do tipo POST
                Yii::$app->response->statusCode = 405; // Method Not Allowed
                return json_encode(['success' => false, 'message' => 'Método não permitido. Utilize POST para cadastrar produtos.']);
            }
            $data = json_decode($request->getRawBody(), true); // Receber os dados JSON
            // Verificar se os dados necessários foram recebidos
            if (isset($data['nome'], $data['cpf'], $data['foto'], $data['sexo'], $data['endereco'])) {
                $transaction = Yii::$app->db->beginTransaction(); // Iniciar transação
                $cliente = new Cliente();
                $cliente->nome = $data['nome'];
                $cliente->cpf = $data['cpf'];
                $cliente->foto = $data['foto'];
                $cliente->sexo = $data['sexo'];
                // Salvar o cliente e o endereço
                if ($cliente->save()) {
---
INSERT INTO `cliente` (`nome`, `cpf`, `foto`, `sexo`) VALUES ('Fulano de Tal', '123.456.789-71', 'url_da_foto.jpg', 'M')

                        $endereco->cidade = $obj->cidade;
                        $endereco->estado = $obj->estado;
                        $endereco->complemento = $obj->complemento;
                        $result = $endereco->save();
---
INSERT INTO `endereco` (`cliente_id`, `cep`, `logradouro`, `numero`, `cidade`, `estado`, `complemento`) VALUES (10, '54450135', 'Rua ABC', '123', 'São Paulo', 'SP', 'Apto 101')

    public function actionListarClientes()
    {
        try {
            $request = Yii::$app->request;
            if (!AuthService::validarToken($request)) {
                // Requisição não é do tipo POST
                Yii::$app->response->statusCode = 405; // Method Not Allowed
                return json_encode(['success' => false, 'message' => 'Token Invalido.']);
            }
            $clientes = Cliente::find()->all();
---
SELECT * FROM `cliente`