controllers/ProdutoController.php

    public function actionListarProdutosClientes()
    {
        try {
            $request = Yii::$app->request;
            if (!AuthService::validarToken($request)) {
                // Requisição não é do tipo POST
                Yii::$app->response->statusCode = 405; // Method Not Allowed
                return json_encode(['success' => false, 'message' => 'Token Invalido.']);
            }
            $produtos = Produto::find()->with('cliente')->all();
---
SELECT * FROM `cliente` WHERE `id` IN (1, 7)
SELECT * FROM `produto`